var node = $('.img-plate').remove();
$('body').empty().append(node);
$('.plan__bubble').remove();
$('.butSizer').remove();
$('#plan').mapster('unbind');


var sold = window.prompt().split("\r\n");
//sold = ["ЧЕС-1-030","ЧЕС-1-031","ЧЕС-1-067","ЧЕС-1-070","ЧЕС-1-077","ЧЕС-1-109","ЧЕС-2-001","ЧЕС-2-002","ЧЕС-2-006","ЧЕС-2-007","ЧЕС-2-034","ЧЕС-2-035","ЧЕС-2-037","ЧЕС-2-043","ЧЕС-2-044","ЧЕС-2-050","ЧЕС-2-054","ЧЕС-2-073","ЧЕС-2-078","ЧЕС-2-079","ЧЕС-2-081","ЧЕС-2-082","ЧЕС-2-091","ЧЕС-2-097","ЧЕС-2-106","ЧЕС-3-010","ЧЕС-3-042","ЧЕС-3-047","ЧЕС-3-048","ЧЕС-3-066","ЧЕС-3-069","ЧЕС-3-080","ЧЕС-3-085","ЧЕС-6-004","ЧЕС-6-032","ЧЕС-6-053","ЧЕС-6-070а","ЧЕС-6-072,6-073","ЧЕС-6-081а","ЧЕС-6-082","ЧЕС-7-012","ЧЕС-7-013","ЧЕС-7-014б","ЧЕС-7-015б","ЧЕС-7-019","ЧЕС-7-021","ЧЕС-7-037","ЧЕС-7-041","ЧЕС-7-042","ЧЕС-7-050","ЧЕС-7-060а"];

var hash = {};

sold.forEach(function (title) {
	hash[title] = true;
});

$('area').each(function () {
	if (!hash[this.title]) this.parentNode.removeChild(this);
});



$('#plan').mapster({
	selected: true,
	staticState: true,
	stroke: true, 
	fillColor: 'ff0000',
	fillOpacity: 0.8,
	scaleMap: false
});

 $('.img-plate').removeAttr('style');