var node = $('.img-plate').remove();
$('body').empty().append(node);
$('.plan__bubble').remove();
$('.butSizer').remove();
$('#plan').mapster('unbind');


//var sold = window.prompt().split("\r\n");
sold = ["ЧЕС-1-001", "ЧЕС-1-005", "ЧЕС-1-021", "ЧЕС-1-022", "ЧЕС-1-034", "ЧЕС-1-037", "ЧЕС-1-041", "ЧЕС-1-082", "ЧЕС-1-084", "ЧЕС-1-085", "ЧЕС-1-086", "ЧЕС-1-088", "ЧЕС-1-089", "ЧЕС-1-100", "ЧЕС-1-101а", "ЧЕС-1-107", "ЧЕС-1-110", "ЧЕС-2-015а", "ЧЕС-2-017а", "ЧЕС-2-038", "ЧЕС-2-039", "ЧЕС-2-042", "ЧЕС-2-064а", "ЧЕС-2-078", "ЧЕС-3-005", "ЧЕС-3-031", "ЧЕС-3-034", "ЧЕС-3-035", "ЧЕС-3-038а", "ЧЕС-3-038б", "ЧЕС-3-047", "ЧЕС-3-075", "ЧЕС-3-076", "ЧЕС-3-090", "ЧЕС-4-019", "ЧЕС-4-020", "ЧЕС-4-060", "ЧЕС-5-001", "ЧЕС-5-043", "ЧЕС-5-078", "ЧЕС-6-024", "ЧЕС-6-048", "ЧЕС-6-079а", "ЧЕС-6-081", "ЧЕС-7-007", "ЧЕС-7-026", "ЧЕС-7-037", "ЧЕС-7-041а", "ЧЕС-7-042", "ЧЕС-7-050", "ЧЕС-7-079а"];

var hash = {};

sold.forEach(function (title) {
	hash[title] = true;
});

$('area').each(function () {
	if (!hash[this.title]) $(this).remove();
});

$('#plan').mapster({
	selected: true,
	staticState: true,
	fillColor: 'ff0000',
	fillOpacity: 0.8,
	scaleMap: false
});

 $('.img-plate').removeAttr('style');